app/controllers/todos_controller.rb

INSERT INTO "todos" ("name", "description") VALUES (?, ?)  [["name", "kranthi"], ["description", "this is my first todo"]]
---
	def create
		@todo= Todo.new(todo_params)
		if @todo.save